src/cfe/Catalogs/кбп_ЭлементыСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>кбп_ЭлементыСхем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.кбп_ВерсииСхем</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШага</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ТипыШагов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементВыбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетНаСхеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструкция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЕдиница</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ЕдиницыСрока</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИзПеременной</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.кбп_ПеременныеПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимНазначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_РежимыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзятьВРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКнопкиПринятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВозврата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_РежимыВозврата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратВРодителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаПереадресация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТотЖеИсполнительПриВозврате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыборИсполнителяСледующего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложеннаяСхема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_СхемыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложеннаяВерсия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ВерсииСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВложенного</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_РежимыВложенногоПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественныйЗапуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникМножественногоЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСлияния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_РежимыСлияния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДляСлияния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймерЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймерЕдиница</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ЕдиницыСрока</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймерИзПеременной</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.кбп_ПеременныеПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеПриПросрочке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ДействияПриПросрочке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭскалационнаяРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейДоАвтовыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КнопкаАвтовыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ОбработчикиПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Переменная</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.кбп_ПеременныеПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПредмета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючВарианта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШагиВозврата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗавершаемыеШаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КопииДляСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАдресации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кбп_СпособыАдресации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кбп_РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПредмета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВложенного</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПеременнаяРодителя</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.кбп_ПеременныеПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПеременнаяДочернего</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.кбп_ПеременныеПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вход</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выход</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/CommonModules/кбп_ПроцессыAPI/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Запускает процесс по текущей опубликованной версии схемы.
//
// Параметры:
//  Схема - СправочникСсылка.кбп_СхемыПроцессов
//  Предмет - ЛюбаяСсылка, Неопределено
//  Переменные - Структура, Соответствие, Неопределено - значения переменных по имени.
//  Родитель - Неопределено - зарезервировано; вложенные процессы запускает шаг «Вложенный процесс» схемы.
//
// Возвращаемое значение:
//  СправочникСсылка.кбп_Процессы
//
Функция ЗапуститьПроцесс(Схема, Предмет = Неопределено, Переменные = Неопределено, Родитель = Неопределено) Экспорт

	Если ЗначениеЗаполнено(Родитель) Тогда
		ВызватьИсключение НСтр("ru = 'Вложенный процесс запускается шагом «Вложенный процесс» схемы родителя.'");
	КонецЕсли;
	Возврат кбп_Движок.ЗапуститьПроцесс(Схема, Предмет, Переменные);

КонецФункции

// Выполняет задачу нажатием кнопки.
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи
//  ИдКнопки - Строка
//  Комментарий - Строка
//  ЗначенияПолей - Структура, Соответствие, Неопределено - поля к заполнению: имя переменной → значение.
//
// Возвращаемое значение:
//  Структура - Выполнено (Булево).
//
Функция ВыполнитьДействие(Задача, ИдКнопки, Комментарий = "", ЗначенияПолей = Неопределено) Экспорт

	кбп_Движок.ВыполнитьЗадачу(Задача, ИдКнопки, Комментарий, ЗначенияПолей);
	Возврат Новый Структура("Выполнено", Истина);

КонецФункции

// Возвращает задачу на доработку.
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи
//  ИдШагаВозврата - СправочникСсылка.кбп_ЭлементыСхем, Строка - шаг или его ИдЭлемента.
//  Комментарий - Строка
//
// Возвращаемое значение:
//  Структура - Выполнено (Булево).
//
Функция ВернутьНаДоработку(Задача, ИдШагаВозврата, Комментарий) Экспорт

	Шаг = ИдШагаВозврата;
	Если ТипЗнч(ИдШагаВозврата) = Тип("Строка") Тогда
		Шаг = Справочники.кбп_ЭлементыСхем.ПустаяСсылка();
		Для Каждого ЭлементСписка Из кбп_Движок.ШагиДляВозврата(Задача) Цикл
			Если ЭлементСписка.Значение.ИдЭлемента = ИдШагаВозврата Тогда
				Шаг = ЭлементСписка.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	кбп_Движок.ВернутьНаДоработку(Задача, Шаг, Комментарий);
	Возврат Новый Структура("Выполнено", Истина);

КонецФункции

// Переадресация задачи — этап 3 (ФТ-309).
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи
//  НовыйИсполнитель - СправочникСсылка.Пользователи
//  Комментарий - Строка
//
Процедура Переадресовать(Задача, НовыйИсполнитель, Комментарий) Экспорт
	ВызватьИсключение НСтр("ru = 'Переадресация будет доступна на этапе 3.'");
КонецПроцедуры

// Добавляет комментарий в ленту процесса.
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//  Текст - Строка
//  Задача - СправочникСсылка.кбп_Задачи, Неопределено
//  Файлы - Неопределено - вложения, этап 3.
//
Процедура ДобавитьКомментарий(Процесс, Текст, Задача = Неопределено, Файлы = Неопределено) Экспорт
	кбп_Движок.ДобавитьКомментарий(Процесс, Текст, Задача);
КонецПроцедуры

// Прерывает процесс.
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//  Комментарий - Строка
//
Процедура ПрерватьПроцесс(Процесс, Комментарий) Экспорт
	кбп_Движок.ПрерватьПроцесс(Процесс, Комментарий);
КонецПроцедуры

// Приостановка процесса — этап 4 (панель администратора).
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//  Комментарий - Строка
//
Процедура ПриостановитьПроцесс(Процесс, Комментарий = "") Экспорт
	ВызватьИсключение НСтр("ru = 'Приостановка процессов будет доступна на этапе 4.'");
КонецПроцедуры

// Продолжение процесса — этап 4.
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//  Комментарий - Строка
//
Процедура ПродолжитьПроцесс(Процесс, Комментарий = "") Экспорт
	ВызватьИсключение НСтр("ru = 'Продолжение процессов будет доступно на этапе 4.'");
КонецПроцедуры

// Активные процессы по предмету.
//
// Параметры:
//  Предмет - ЛюбаяСсылка
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.кбп_Процессы
//
Функция АктивныеПроцессыПредмета(Предмет) Экспорт
	Возврат кбп_Движок.АктивныеПроцессыПредмета(Предмет);
КонецФункции

// Задачи пользователя.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  Отбор - Структура, Неопределено - ВключаяВыполненные (Булево).
//
// Возвращаемое значение:
//  ТаблицаЗначений - см. кбп_Движок.ЗадачиПользователя.
//
Функция ЗадачиПользователя(Пользователь, Отбор = Неопределено) Экспорт

	ВключаяВыполненные = Ложь;
	Если Отбор <> Неопределено Тогда
		Отбор.Свойство("ВключаяВыполненные", ВключаяВыполненные);
	КонецЕсли;
	Возврат кбп_Движок.ЗадачиПользователя(Пользователь, ВключаяВыполненные = Истина);

КонецФункции

// Состояние процесса и его активные задачи.
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//
// Возвращаемое значение:
//  Структура - Состояние (ПеречислениеСсылка.кбп_СостоянияПроцессов), Задачи (ТаблицаЗначений).
//
Функция СостояниеПроцесса(Процесс) Экспорт

	Задачи = кбп_Движок.ЗадачиПроцесса(Процесс);
	Активные = Задачи.СкопироватьКолонки();
	Для Каждого СтрокаЗадачи Из Задачи Цикл
		Если кбп_Движок.СостоянияАктивных().Найти(СтрокаЗадачи.Состояние) <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Активные.Добавить(), СтрокаЗадачи);
		КонецЕсли;
	КонецЦикла;
	Возврат Новый Структура("Состояние, Задачи", Процесс.Состояние, Активные);

КонецФункции

#КонецОбласти
